software_metrics.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>software-metrics</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="orgec04054">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-orgabe1ddb" class="outline-2">
<h2 id="orgabe1ddb">Metrics</h2>
<div class="outline-text-2" id="text-orgabe1ddb">
<p>
Thee who watches the watchers
</p>
</div>
<div id="outline-container-org0279b6e" class="outline-3">
<h3 id="org0279b6e">notes</h3>
<div class="outline-text-3" id="text-org0279b6e">
<ul class="org-ul">
<li>most profilers require frame pointers, almost all require debug information(can store seperately)</li>
<li><code>sudo scx_lavd --performance</code> for latency aware scheduler (gpu/drm is wip)</li>
<li>monitoring
<ul class="org-ul">
<li><a href="netdata.html#ID-da54ebe6-f11a-4431-b50f-ee281502998a">netdata</a></li>
<li><a href="prometheus_tech.html#ID-15a1bd83-5412-4ea3-b883-d2026fc2966a">prometheus-tech</a></li>
</ul></li>
<li>profilers
<ul class="org-ul">
<li><a href="https://github.com/intel/oneapi-containers/tree/master/images/docker/vtune">https://github.com/intel/oneapi-containers/tree/master/images/docker/vtune</a></li>
</ul></li>
<li>perforator
<ul class="org-ul">
<li>record flamegraph and compare (ebpf collection)</li>
</ul></li>
<li>pyroscope
<ul class="org-ul">
<li>aggregates profiling data for flamegraphs</li>
<li>compare flamegraphs with grafana and alloy(ebpf collection)
<ul class="org-ul">
<li>grafana config: <a href="https://github.com/grafana/pyroscope/tree/main/examples/grafana-alloy-auto-instrumentation/ebpf">https://github.com/grafana/pyroscope/tree/main/examples/grafana-alloy-auto-instrumentation/ebpf</a>
<ul class="org-ul">
<li>rename urls for localhost and remove alloy as root dns on rootless podman was not resolving&#x2026;</li>
</ul></li>
<li><code>sudo ./alloy-linux-amd64 run /gnu/git/alloy.config --storage.path=/gnu/git/alloy</code></li>
</ul></li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-conf" id="org3aef362">discovery.process "all" {}

discovery.relabel "btm" {
    targets = discovery.process.all.targets
    // Filter needed processes
    rule {
        source_labels = ["__meta_process_exe"]
        regex = ".*/btm"
        action = "keep"
    }
     // provide arbitrary service_name label, otherwise it will be "unspecified"
    rule {
        source_labels = ["__meta_process_exe"]
        target_label = "service_name"
        regex = ".*/btm"
        action = "replace"
        replacement = "bottom"
    }
}
pyroscope.ebpf "instance" {
    demangle = "full"
    off_cpu_threshold = 1
    forward_to = [pyroscope.write.endpoint.receiver]
    targets = discovery.relabel.btm.output
}

pyroscope.write "endpoint" {
    endpoint {
        url = "http://localhost:4040"
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
